nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/common/pin_mux/pin_mux.c
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXW70ACxxx
package_id: MCXW70ACMFT
mcu_data: ksdk2_0
processor_version: 0.0.0
pin_labels:
- {pin_num: '26', pin_signal: ADC0_A15/PTD3/LPTMR1_ALT3/TAMPER1/RF_GPO_6/TPM2_CH1/TRGMUX0_IN2/LPTMR0_TRIG_OUT_b, label: LED_GREEN, identifier: LED_GREEN}
- {pin_num: '25', pin_signal: ADC0_A14/PTD2/LPTMR0_ALT3/TAMPER0/RF_GPO_5/TPM2_CH0/LPTMR1_TRIG_OUT_b, label: LED_RED, identifier: LED_RED}
- {pin_num: '45', pin_signal: PTC7/TRGMUX0_IN3/TRGMUX0_OUT3/SFA0_CLK/TPM0_CH2/SFA1_CLK/CLKOUT/NMI_b, label: LED_BLUE, identifier: LED_BLUE}
- {pin_num: '10', pin_signal: ADC0_A3/CMP0_IN0/PTA5/RF_GPO_9/TRACE_SWO/BOOT_CONFIG/LPSPI2_PCS0, label: SW2, identifier: SW2}
- {pin_num: '24', pin_signal: ADC0_A13/PTD1/SPC0_LPREQ/NMI_b/RF_GPO_4/TPM2_CLKIN/RF_GPO_7, label: SW3, identifier: SW3}
- {pin_num: '5', pin_signal: ADC0_A0/PTA0/TPM1_CLKIN/TRGMUX0_IN1/LPSPI2_SCK, label: SW4, identifier: SW4}
- {pin_num: '43', pin_signal: PTC5/LPSPI1_PCS0/CAN0_RX/LPI2C1_SDA/TPM0_CH1, label: CAN_RX, identifier: CAN_RX}
- {pin_num: '42', pin_signal: PTC4/LPSPI1_SIN/CAN0_TX/LPI2C1_SCL/TPM0_CH0, label: CAN_TX, identifier: CAN_TX}
- {pin_num: '47', pin_signal: ADC0_A10/PTB1/LPSPI1_SIN/TPM0_CH4, label: FLASH_SIN, identifier: FLASH_SIN}
- {pin_num: '1', pin_signal: PTB3/LPSPI1_SOUT/LPUART1_RX/TPM3_CLKIN/PWM0_X0, label: FLASH_SOUT, identifier: FLASH_SOUT}
- {pin_num: '46', pin_signal: ADC0_A9/PTB0/LPSPI1_PCS0/TPM0_CH3, label: FLASH_CS, identifier: FLASH_CS}
- {pin_num: '48', pin_signal: ADC0_A11/PTB2/LPSPI1_SCK/LPUART1_TX/TPM0_CH5, label: FLASH_SCK, identifier: FLASH_SCK}
- {pin_num: '37', pin_signal: PTC0/LPSPI1_PCS2/CAN0_TX/TPM4_CLKIN/LPI2C1_SCL/LPSPI2_PCS3, label: I2C_SCL_FXLS, identifier: I2C_SCL_FXLS}
- {pin_num: '38', pin_signal: PTC1/LPSPI1_PCS3/CAN0_RX/TPM4_CH0/LPI2C1_SDA, label: I2C_SDA_FXLS, identifier: I2C_SDA_FXLS}
- {pin_num: '17', pin_signal: ADC0_A6/CMP0_IN3/PTA20/LPSPI0_PCS2/LPUART0_TX/EWM0_IN/RF_GPO_2/PWM0_A2, label: SNS_LIGHT, identifier: SNS_LIGHT}
- {pin_num: '39', pin_signal: PTC2/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM4_CH1, label: DEBUG_UART_RX, identifier: DEBUG_UART_RX}
- {pin_num: '40', pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM0_CLKIN, label: DEBUG_UART_TX, identifier: DEBUG_UART_TX}
- {pin_num: '11', pin_signal: ADC0_A4/PTA16/LPSPI0_PCS0/EWM0_OUT_b/LPI2C0_SCLS/LPUART0_RX/RF_GPO_8/PWM0_A0, label: LIN_RX, identifier: LIN_RX}
- {pin_num: '12', pin_signal: ADC0_A5/PTA17/LPSPI0_SIN/EWM0_IN/LPI2C0_SDAS/LPUART0_TX/RF_GPO_7/RF_GPO_8/PWM0_B0, label: LIN_TX, identifier: LIN_TX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: LPUART_1, signal: RX, pin_signal: PTC2/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM4_CH1, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '40', peripheral: LPUART_1, signal: TX, pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM0_CLKIN, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t DEBUG_UART_RX = {/* Internal pull-up/down resistor is disabled */
                                             .pullSelect = (uint16_t)kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             .slewRate = (uint16_t)kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                             /* Low drive strength is configured */
                                             .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                             /* Pin is configured as LPUART1_RX */
                                             .mux = (uint16_t)kPORT_MuxAlt3,
                                             /* Digital input is not inverted */
                                             .invertInput = (uint16_t)kPORT_InputNormal,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinConfig(BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN, &DEBUG_UART_RX);

