nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/common/pin_mux/pin_mux.c
    const port_pin_config_t DEBUG_UART_TX = {/* Internal pull-up/down resistor is disabled */
                                             .pullSelect = (uint16_t)kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             .slewRate = (uint16_t)kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                             /* Low drive strength is configured */
                                             .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                             /* Pin is configured as LPUART1_TX */
                                             .mux = (uint16_t)kPORT_MuxAlt3,
                                             /* Digital input is not inverted */
                                             .invertInput = (uint16_t)kPORT_InputNormal,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C3 (pin 40) is configured as LPUART1_TX */
    PORT_SetPinConfig(BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN, &DEBUG_UART_TX);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '25', peripheral: GPIO_D, signal: 'GPIO, 2', pin_signal: ADC0_A14/PTD2/LPTMR0_ALT3/TAMPER0/RF_GPO_5/TPM2_CH0/LPTMR1_TRIG_OUT_b, direction: OUTPUT, gpio_init_state: 'false',
    pull_select: down, pull_enable: disable, pull_value: low, passive_filter: disable, open_drain: disable}
  - {pin_num: '26', peripheral: GPIO_D, signal: 'GPIO, 3', pin_signal: ADC0_A15/PTD3/LPTMR1_ALT3/TAMPER1/RF_GPO_6/TPM2_CH1/TRGMUX0_IN2/LPTMR0_TRIG_OUT_b, direction: OUTPUT,
    gpio_init_state: 'false', pull_select: down, pull_enable: disable, pull_value: low, passive_filter: disable, open_drain: disable}
  - {pin_num: '45', peripheral: GPIO_C, signal: 'GPIO, 7', pin_signal: PTC7/TRGMUX0_IN3/TRGMUX0_OUT3/SFA0_CLK/TPM0_CH2/SFA1_CLK/CLKOUT/NMI_b, direction: OUTPUT, gpio_init_state: 'false',
    pull_select: down, pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLEDsPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioC);

    const port_pin_config_t LED_BLUE = {/* Internal pull-up/down resistor is disabled */
                                        .pullSelect = (uint16_t)kPORT_PullDisable,
                                        /* Low internal pull resistor value is selected. */
                                        .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                        .slewRate = (uint16_t)kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                        .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                        .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                        /* Pin is configured as PTC7 */
                                        .mux = (uint16_t)kPORT_MuxAsGpio,
                                        /* Digital input is not inverted */
                                        .invertInput = (uint16_t)kPORT_InputNormal,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C7 (pin 45) is configured as PTC7 */
    PORT_SetPinConfig(BOARD_INITLEDSPINS_LED_BLUE_PORT, BOARD_INITLEDSPINS_LED_BLUE_PIN, &LED_BLUE);

    const port_pin_config_t LED_RED = {/* Internal pull-up/down resistor is disabled */
                                       .pullSelect = (uint16_t)kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       .slewRate = (uint16_t)kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                       /* Pin is configured as PTD2 */
                                       .mux = (uint16_t)kPORT_MuxAsGpio,
                                       /* Digital input is not inverted */
                                       .invertInput = (uint16_t)kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_D2 (pin 25) is configured as PTD2 */
    PORT_SetPinConfig(BOARD_INITLEDSPINS_LED_RED_PORT, BOARD_INITLEDSPINS_LED_RED_PIN, &LED_RED);

    const port_pin_config_t LED_GREEN = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Pin is configured as PTD3 */
                                         .mux = (uint16_t)kPORT_MuxAsGpio,
                                         /* Digital input is not inverted */
                                         .invertInput = (uint16_t)kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_D3 (pin 26) is configured as PTD3 */
    PORT_SetPinConfig(BOARD_INITLEDSPINS_LED_GREEN_PORT, BOARD_INITLEDSPINS_LED_GREEN_PIN, &LED_GREEN);

    gpio_pin_config_t LED_BLUE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 45)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED_BLUE_GPIO, BOARD_INITLEDSPINS_LED_BLUE_PIN, &LED_BLUE_config);

