nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/common/pin_mux/pin_mux.c
    gpio_pin_config_t LED_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 25)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED_RED_GPIO, BOARD_INITLEDSPINS_LED_RED_PIN, &LED_RED_config);

    gpio_pin_config_t LED_GREEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin 26)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED_GREEN_GPIO, BOARD_INITLEDSPINS_LED_GREEN_PIN, &LED_GREEN_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitButtonsPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '10', peripheral: GPIO_A, signal: 'GPIO, 5', pin_signal: ADC0_A3/CMP0_IN0/PTA5/RF_GPO_9/TRACE_SWO/BOOT_CONFIG/LPSPI2_PCS0, direction: INPUT, gpio_per_interrupt: kGPIO_InterruptStatusFlagDisabled,
    pull_select: down, pull_enable: enable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '24', peripheral: GPIO_D, signal: 'GPIO, 1', pin_signal: ADC0_A13/PTD1/SPC0_LPREQ/NMI_b/RF_GPO_4/TPM2_CLKIN/RF_GPO_7, direction: INPUT, gpio_per_interrupt: kGPIO_InterruptStatusFlagDisabled,
    pull_select: up, pull_enable: enable, pull_value: low, passive_filter: disable, open_drain: disable}
  - {pin_num: '5', peripheral: GPIO_A, signal: 'GPIO, 0', pin_signal: ADC0_A0/PTA0/TPM1_CLKIN/TRGMUX0_IN1/LPSPI2_SCK, direction: INPUT, gpio_per_interrupt: kGPIO_InterruptStatusFlagDisabled,
    pull_select: up, pull_enable: enable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitButtonsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitButtonsPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioA);

    const port_pin_config_t SW4 = {/* Internal pull-up resistor is enabled */
                                   .pullSelect = (uint16_t)kPORT_PullUp,
                                   /* Low internal pull resistor value is selected. */
                                   .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                   /* Fast slew rate is configured */
                                   .slewRate = (uint16_t)kPORT_FastSlewRate,
                                   /* Passive input filter is disabled */
                                   .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                   /* Open drain output is disabled */
                                   .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                   /* Low drive strength is configured */
                                   .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                   /* Pin is configured as PTA0 */
                                   .mux = (uint16_t)kPORT_MuxAsGpio,
                                   /* Digital input is not inverted */
                                   .invertInput = (uint16_t)kPORT_InputNormal,
                                   /* Pin Control Register fields [15:0] are not locked */
                                   .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_A0 (pin 5) is configured as PTA0 */
    PORT_SetPinConfig(BOARD_INITBUTTONSPINS_SW4_PORT, BOARD_INITBUTTONSPINS_SW4_PIN, &SW4);

    const port_pin_config_t SW2 = {/* Internal pull-down resistor is enabled */
                                   .pullSelect = (uint16_t)kPORT_PullDown,
                                   /* Low internal pull resistor value is selected. */
                                   .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                   /* Fast slew rate is configured */
                                   .slewRate = (uint16_t)kPORT_FastSlewRate,
                                   /* Passive input filter is disabled */
                                   .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                   /* Open drain output is disabled */
                                   .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                   /* Low drive strength is configured */
                                   .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                   /* Pin is configured as PTA5 */
                                   .mux = (uint16_t)kPORT_MuxAsGpio,
                                   /* Digital input is not inverted */
                                   .invertInput = (uint16_t)kPORT_InputNormal,
                                   /* Pin Control Register fields [15:0] are not locked */
                                   .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_A5 (pin 10) is configured as PTA5 */
    PORT_SetPinConfig(BOARD_INITBUTTONSPINS_SW2_PORT, BOARD_INITBUTTONSPINS_SW2_PIN, &SW2);

    const port_pin_config_t SW3 = {/* Internal pull-up resistor is enabled */
                                   .pullSelect = (uint16_t)kPORT_PullUp,
                                   /* Low internal pull resistor value is selected. */
                                   .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                   /* Fast slew rate is configured */
                                   .slewRate = (uint16_t)kPORT_FastSlewRate,
                                   /* Passive input filter is disabled */
                                   .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                   /* Open drain output is disabled */
                                   .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                   /* Low drive strength is configured */
                                   .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                   /* Pin is configured as PTD1 */
                                   .mux = (uint16_t)kPORT_MuxAsGpio,
                                   /* Digital input is not inverted */
                                   .invertInput = (uint16_t)kPORT_InputNormal,
                                   /* Pin Control Register fields [15:0] are not locked */
                                   .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_D1 (pin 24) is configured as PTD1 */
    PORT_SetPinConfig(BOARD_INITBUTTONSPINS_SW3_PORT, BOARD_INITBUTTONSPINS_SW3_PIN, &SW3);

