nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlashPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlashPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t FLASH_CS = {/* Internal pull-up resistor is enabled */
                                        .pullSelect = (uint16_t)kPORT_PullUp,
                                        /* Low internal pull resistor value is selected. */
                                        .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                        .slewRate = (uint16_t)kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                        .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                        .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                        /* Pin is configured as LPSPI1_PCS0 */
                                        .mux = (uint16_t)kPORT_MuxAlt2,
                                        /* Digital input is not inverted */
                                        .invertInput = (uint16_t)kPORT_InputNormal,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B0 (pin 46) is configured as LPSPI1_PCS0 */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_CS_PORT, BOARD_INITFLASHPINS_FLASH_CS_PIN, &FLASH_CS);

    const port_pin_config_t FLASH_SIN = {/* Internal pull-up resistor is enabled */
                                         .pullSelect = (uint16_t)kPORT_PullUp,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Pin is configured as LPSPI1_SIN */
                                         .mux = (uint16_t)kPORT_MuxAlt2,
                                         /* Digital input is not inverted */
                                         .invertInput = (uint16_t)kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B1 (pin 47) is configured as LPSPI1_SIN */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SIN_PORT, BOARD_INITFLASHPINS_FLASH_SIN_PIN, &FLASH_SIN);

    const port_pin_config_t FLASH_SCK = {/* Internal pull-up resistor is enabled */
                                         .pullSelect = (uint16_t)kPORT_PullUp,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Pin is configured as LPSPI1_SCK */
                                         .mux = (uint16_t)kPORT_MuxAlt2,
                                         /* Digital input is not inverted */
                                         .invertInput = (uint16_t)kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B2 (pin 48) is configured as LPSPI1_SCK */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SCK_PORT, BOARD_INITFLASHPINS_FLASH_SCK_PIN, &FLASH_SCK);

    const port_pin_config_t FLASH_SOUT = {/* Internal pull-up resistor is enabled */
                                          .pullSelect = (uint16_t)kPORT_PullUp,
                                          /* Low internal pull resistor value is selected. */
                                          .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          .slewRate = (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                          /* Pin is configured as LPSPI1_SOUT */
                                          .mux = (uint16_t)kPORT_MuxAlt2,
                                          /* Digital input is not inverted */
                                          .invertInput = (uint16_t)kPORT_InputNormal,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B3 (pin 1) is configured as LPSPI1_SOUT */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SOUT_PORT, BOARD_INITFLASHPINS_FLASH_SOUT_PIN, &FLASH_SOUT);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACCELPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '37', peripheral: LPI2C_1, signal: SCL, pin_signal: PTC0/LPSPI1_PCS2/CAN0_TX/TPM4_CLKIN/LPI2C1_SCL/LPSPI2_PCS3, pull_select: up, pull_enable: enable,
    slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '38', peripheral: LPI2C_1, signal: SDA, pin_signal: PTC1/LPSPI1_PCS3/CAN0_RX/TPM4_CH0/LPI2C1_SDA, pull_select: up, pull_enable: enable, slew_rate: fast,
    passive_filter: disable, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

